tylertms/dspic33e-sim/src/firmware_runner.c
static bool event_number(const JsonValue* specification, const char* name,
                         uint64_t maximum, uint64_t default_value, bool required,
                         uint64_t* result) {
    const JsonValue* value = json_get(specification, name);
    int64_t parsed;
    if (value == NULL) {
        if (required) {
            return false;
        }
        *result = default_value;
        return true;
    }
    if (!parse_number(value, &parsed) || parsed < 0 || (uint64_t)parsed > maximum) {
        return false;
    }
    *result = (uint64_t)parsed;
    return true;
}

static bool apply_device_stimulus(Dspic33* cpu, const char* type,
                                  const JsonValue* specification, char* error,
                                  size_t error_size) {
    uint64_t channel = 0u;
    uint64_t value = 0u;
    uint64_t delay = 0u;
    bool succeeded = false;
    if (!event_number(specification, "delay", UINT64_MAX, 0u, false, &delay)) {
        snprintf(error, error_size, "invalid %s stimulus delay", type);
        return false;
    }
    if (strcmp(type, "interrupts") == 0) {
        succeeded = event_number(specification, "irq", DSPIC33_IRQ_COUNT - 1u, 0u, true,
                                 &channel) &&
                    dspic33_schedule(cpu, DSPIC33_EVENT_INTERRUPT, (uint16_t)channel,
                                     0u, delay);
    } else if (strcmp(type, "dma_requests") == 0) {
        succeeded =
            event_number(specification, "request", UINT8_MAX, 0u, true, &channel) &&
            event_number(specification, "indirect_address", UINT16_MAX, 0u, false,
                         &value) &&
            dspic33_dma_request(cpu, (uint8_t)channel, (uint16_t)value, delay);
    } else if (strcmp(type, "timer_pulses") == 0) {
        succeeded =
            event_number(specification, "timer", DSPIC33_TIMER_COUNT, 0u, true,
                         &channel) &&
            channel != 0u &&
            event_number(specification, "pulses", UINT32_MAX, 0u, true, &value) &&
            value != 0u &&
            dspic33_timer_pulse(cpu, (uint8_t)(channel - 1u), (uint32_t)value, delay);
    } else if (strcmp(type, "timer_gates") == 0) {
        const JsonValue* high_value = json_get(specification, "high");
        bool high = false;
        succeeded = event_number(specification, "timer", DSPIC33_TIMER_COUNT, 0u, true,
                                 &channel) &&
                    channel != 0u && high_value != NULL &&
                    json_boolean(high_value, &high) &&
                    dspic33_timer_gate(cpu, (uint8_t)(channel - 1u), high, delay);
    } else if (strcmp(type, "uart_rx") == 0) {
        succeeded = event_number(specification, "channel", DSPIC33_UART_COUNT - 1u, 0u,
                                 true, &channel) &&
                    event_number(specification, "value", UINT8_MAX, 0u, true, &value) &&
                    dspic33_uart_receive(cpu, (uint8_t)channel, (uint8_t)value, delay);
    } else if (strcmp(type, "spi_rx") == 0) {
        succeeded =
            event_number(specification, "channel", DSPIC33_SPI_COUNT - 1u, 0u, true,
                         &channel) &&
            event_number(specification, "value", UINT16_MAX, 0u, true, &value) &&
            dspic33_spi_receive(cpu, (uint8_t)channel, (uint16_t)value, delay);
    } else if (strcmp(type, "spi_select") == 0) {
        const JsonValue* selected_value = json_get(specification, "selected");
        bool selected = false;
        succeeded = event_number(specification, "channel", DSPIC33_SPI_COUNT - 1u, 0u,
                                 true, &channel) &&
                    selected_value != NULL && json_boolean(selected_value, &selected) &&
                    dspic33_spi_select(cpu, (uint8_t)channel, selected, delay);
    } else if (strcmp(type, "adc") == 0) {
        succeeded = event_number(specification, "channel",
                                 DSPIC33_ADC_CHANNEL_COUNT - 1u, 0u, true, &channel) &&
                    event_number(specification, "value", 0x0fffu, 0u, true, &value);
        if (succeeded) {
            dspic33_adc_input(cpu, (uint8_t)channel, (uint16_t)value);
        }
    } else if (strcmp(type, "adc_triggers") == 0) {
        succeeded =
            event_number(specification, "module", DSPIC33_ADC_COUNT, 0u, true,
                         &channel) &&
            channel != 0u &&
            event_number(specification, "source", 14u, 0u, true, &value) &&
            dspic33_adc_trigger(cpu, (uint8_t)(channel - 1u), (uint8_t)value, delay);
    } else if (strcmp(type, "pwm_faults") == 0 ||
               strcmp(type, "pwm_current_limits") == 0) {
        const JsonValue* high_value = json_get(specification, "high");
        bool high = false;
        succeeded =
            event_number(specification, "source", DSPIC33_PWM_INPUT_COUNT - 1u, 0u,
                         true, &channel) &&
            high_value != NULL && json_boolean(high_value, &high) &&
            (strcmp(type, "pwm_faults") == 0
                 ? dspic33_pwm_fault(cpu, (uint8_t)channel, high, delay)
                 : dspic33_pwm_current_limit(cpu, (uint8_t)channel, high, delay));
    } else if (strcmp(type, "pwm_sync") == 0) {
        const JsonValue* high_value = json_get(specification, "high");
        bool high = false;
        succeeded = event_number(specification, "input", 2u, 0u, true, &channel) &&
                    channel != 0u && high_value != NULL &&
                    json_boolean(high_value, &high) &&
                    dspic33_pwm_sync(cpu, (uint8_t)(channel - 1u), high, delay);
    } else if (strcmp(type, "pwm_dead_time") == 0) {
        const JsonValue* high_value = json_get(specification, "high");
        bool high = false;
        succeeded = event_number(specification, "generator", DSPIC33_PWM_COUNT, 0u,
                                 true, &channel) &&
                    channel != 0u && high_value != NULL &&
                    json_boolean(high_value, &high) &&
                    dspic33_pwm_dead_time(cpu, (uint8_t)(channel - 1u), high, delay);
    } else if (strcmp(type, "can_errors") == 0) {
        const JsonValue* transmit_value = json_get(specification, "transmit");
        bool transmit = false;
        succeeded =
            event_number(specification, "channel", DSPIC33_CAN_COUNT - 1u, 0u, true,
                         &channel) &&
            event_number(specification, "count", UINT8_MAX, 0u, true, &value) &&
            value != 0u && transmit_value != NULL &&
            json_boolean(transmit_value, &transmit) &&
            dspic33_can_error(cpu, (uint8_t)channel, transmit, (uint8_t)value, delay);
    } else if (strcmp(type, "can_rx") == 0) {
        const JsonValue* data = json_get(specification, "data");
        const JsonValue* extended_value = json_get(specification, "extended");
        const JsonValue* remote_value = json_get(specification, "remote");
        Dspic33CanFrame frame;
        size_t index;
        memset(&frame, 0, sizeof(frame));
        succeeded =
            event_number(specification, "channel", DSPIC33_CAN_COUNT - 1u, 0u, true,
                         &channel) &&
            event_number(specification, "identifier", 0x1fffffffu, 0u, true, &value) &&
            data != NULL && data->type == JSON_ARRAY &&
            data->as.array.count <= sizeof(frame.data);
        frame.identifier = (uint32_t)value;
        frame.length = succeeded ? (uint8_t)data->as.array.count : 0u;
        if (extended_value != NULL && !json_boolean(extended_value, &frame.extended)) {
            succeeded = false;
        }
        if (remote_value != NULL && !json_boolean(remote_value, &frame.remote)) {
            succeeded = false;
        }
        for (index = 0u; succeeded && index < frame.length; index++) {
            int64_t byte;
            succeeded = parse_number(data->as.array.items[index], &byte) && byte >= 0 &&
                        byte <= UINT8_MAX;
            frame.data[index] = (uint8_t)byte;
        }
        succeeded =
            succeeded && dspic33_can_receive(cpu, (uint8_t)channel, &frame, delay);
    } else if (strcmp(type, "usb_rx") == 0) {
        const JsonValue* data = json_get(specification, "data");
        uint8_t bytes[64];
        size_t index;
        succeeded = event_number(specification, "endpoint", 15u, 0u, true, &channel) &&
                    data != NULL && data->type == JSON_ARRAY &&
                    data->as.array.count <= sizeof(bytes);
        for (index = 0u; succeeded && index < data->as.array.count; index++) {
            int64_t byte;
            succeeded = parse_number(data->as.array.items[index], &byte) && byte >= 0 &&
                        byte <= UINT8_MAX;
            bytes[index] = (uint8_t)byte;
        }
        succeeded =
            succeeded && dspic33_usb_receive(cpu, (uint8_t)channel, bytes,
                                             (uint16_t)data->as.array.count, delay);
    }
    if (!succeeded) {
        snprintf(error, error_size, "invalid %s stimulus", type);
    }
    return succeeded;
}

static bool apply_device_stimuli_pair(Runner* runner, const JsonValue* stimuli,
                                      const char* type, char* error,
                                      size_t error_size) {
    const JsonValue* values = json_get(stimuli, type);
    size_t index;
    if (values == NULL) {
        return true;
    }
    if (values->type != JSON_ARRAY) {
        snprintf(error, error_size, "%s stimuli must be an array", type);
        return false;
    }
    for (index = 0u; index < values->as.array.count; index++) {
        if (!apply_device_stimulus(&runner->reference, type,
                                   values->as.array.items[index], error, error_size) ||
            !apply_device_stimulus(&runner->candidate, type,
                                   values->as.array.items[index], error, error_size)) {
            return false;
        }
    }
    return true;
}

static bool apply_stimuli_part(Runner* runner, const JsonValue* part, char* error,
                               size_t error_size) {
    const JsonValue* stimuli = json_get(part, "stimuli");
    const JsonValue* values;
    size_t index;
    if (stimuli == NULL) {
        return true;
    }
    values = json_get(stimuli, "memory");
    if (values != NULL && values->type == JSON_ARRAY) {
        for (index = 0u; index < values->as.array.count; index++) {
            if (!write_memory_value(
                    runner, &runner->reference, &runner->reference_image,
                    values->as.array.items[index], false, error, error_size) ||
                !write_memory_value(
                    runner, &runner->candidate, &runner->candidate_image,
                    values->as.array.items[index], true, error, error_size)) {
                return false;
            }
        }
    }
    values = json_get(stimuli, "registers");
    if (values != NULL && values->type == JSON_ARRAY) {
        for (index = 0u; index < values->as.array.count; index++) {
            if (!apply_register(runner, &runner->reference, &runner->reference_image,
                                values->as.array.items[index], false, error,
                                error_size) ||
                !apply_register(runner, &runner->candidate, &runner->candidate_image,
                                values->as.array.items[index], true, error,
                                error_size)) {
                return false;
            }
        }
    }
    values = json_get(stimuli, "pins");
    if (values != NULL && values->type == JSON_ARRAY) {
        for (index = 0u; index < values->as.array.count; index++) {
            if (!apply_pin(&runner->reference, values->as.array.items[index], error,
                           error_size) ||
                !apply_pin(&runner->candidate, values->as.array.items[index], error,
                           error_size)) {
                return false;
            }
        }
    }
    return apply_device_stimuli_pair(runner, stimuli, "interrupts", error,
                                     error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "dma_requests", error,
                                     error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "timer_pulses", error,
                                     error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "timer_gates", error,
                                     error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "uart_rx", error, error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "spi_select", error,
                                     error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "spi_rx", error, error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "adc", error, error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "adc_triggers", error,
                                     error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "pwm_faults", error,
                                     error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "pwm_current_limits", error,
                                     error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "pwm_dead_time", error,
                                     error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "pwm_sync", error, error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "can_errors", error,
                                     error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "can_rx", error, error_size) &&
           apply_device_stimuli_pair(runner, stimuli, "usb_rx", error, error_size);
}

static void reset_pair(Runner* runner) {
    dspic33_reset(&runner->reference, 0u);
    dspic33_reset(&runner->candidate, 0u);
    dspic33_gpio_input(&runner->reference, 1u, 1u);
    dspic33_gpio_input(&runner->candidate, 1u, 1u);
}

static bool save_baseline(Runner* runner, char* error, size_t error_size) {
    if (!dspic33_copy(&runner->reference_baseline, &runner->reference) ||
        !dspic33_copy(&runner->candidate_baseline, &runner->candidate)) {
        snprintf(error, error_size, "cannot save simulator baseline");
        return false;
    }
    return true;
}

static bool restore_baseline(Runner* runner, char* error, size_t error_size) {
    if (!dspic33_copy(&runner->reference, &runner->reference_baseline) ||
        !dspic33_copy(&runner->candidate, &runner->candidate_baseline)) {
        snprintf(error, error_size, "cannot restore simulator baseline");
        return false;
    }
    return true;
}

static void print_cpu_diagnostics(const Dspic33* cpu) {
    uint64_t start = cpu->interrupt_count > 4u ? cpu->interrupt_count - 4u : 0u;
    uint64_t item;
    for (item = start; item < cpu->interrupt_count; item++) {
        size_t index = (size_t)(item % 16u);
        printf("  interrupt #%-6" PRIu64 " irq=%u interrupted=0x%06" PRIx32
               " return=0x%06" PRIx32 "\n",
               item + 1u, cpu->interrupt_log_irq[index],
               cpu->interrupt_log_entry[index], cpu->interrupt_log_return[index]);
    }
    printf("  state PC=0x%06" PRIx32 " W0=0x%04x W1=0x%04x W2=0x%04x "
           "W3=0x%04x W4=0x%04x W5=0x%04x W6=0x%04x W7=0x%04x "
           "W8=0x%04x W9=0x%04x W10=0x%04x W11=0x%04x W12=0x%04x "
           "W13=0x%04x W14=0x%04x W15=0x%04x SR=0x%04x TBLPAG=0x%04x DSRPAG=0x%04x "
           "DSWPAG=0x%04x\n",
           cpu->pc, cpu->w[0], cpu->w[1], cpu->w[2], cpu->w[3], cpu->w[4], cpu->w[5],
           cpu->w[6], cpu->w[7], cpu->w[8], cpu->w[9], cpu->w[10], cpu->w[11],
           cpu->w[12], cpu->w[13], cpu->w[14], cpu->w[15], cpu->sr, cpu->tblpag,
           cpu->dsrpag, cpu->dswpag);
    printf("  control call-depth=%u interrupt-depth=%u instructions=%" PRIu64
           " cycles=%" PRIu64 "\n",
           cpu->call_depth, cpu->interrupt_depth, cpu->instructions, cpu->cycles);
}

static uint32_t stopped_opcode(const Dspic33* cpu) {
    if (cpu->unsupported_opcode != 0u) {
        return cpu->unsupported_opcode;
    }
    return cpu->pc < DSPIC33_PROGRAM_LIMIT ? cpu->program[cpu->pc / 2u] : 0u;
}

