tylertms/dspic33e-sim/src/firmware_runner.c
static bool run_image(Runner* runner, Dspic33* cpu, bool candidate,
                      const JsonValue* call, const JsonValue* stop, char* error,
                      size_t error_size, bool* execution_failure) {
    uint32_t address;
    Dspic33StopReason reason;
    *execution_failure = false;
    if (call != NULL) {
        if (!mapped_address(runner, call, candidate, &address, error, error_size)) {
            return false;
        }
        cpu->pc = address;
        cpu->call_depth = 0u;
    }
    if (stop != NULL) {
        if (!mapped_address(runner, stop, candidate, &address, error, error_size)) {
            return false;
        }
        reason = dspic33_run_until(cpu, address, runner->instruction_limit);
        if (reason != DSPIC33_STOPPED) {
            *execution_failure = true;
            snprintf(error, error_size,
                     "%s stopped with %s at 0x%06" PRIx32 " opcode=0x%06" PRIx32
                     " irq=%u irq-return=0x%06" PRIx32 " interrupts=%" PRIu64
                     " resets=%" PRIu64 " reset-irq=%u",
                     candidate ? "candidate" : "reference",
                     dspic33_stop_reason_name(reason), cpu->pc, stopped_opcode(cpu),
                     cpu->last_interrupt, cpu->last_interrupt_return,
                     cpu->interrupt_count, cpu->software_reset_count,
                     cpu->reset_interrupt);
            return false;
        }
    } else {
        reason = dspic33_run(cpu, runner->instruction_limit);
        if (reason != DSPIC33_RETURNED) {
            *execution_failure = true;
            snprintf(error, error_size,
                     "%s stopped with %s at 0x%06" PRIx32 " opcode=0x%06" PRIx32
                     " irq=%u irq-return=0x%06" PRIx32 " interrupts=%" PRIu64
                     " resets=%" PRIu64 " reset-irq=%u",
                     candidate ? "candidate" : "reference",
                     dspic33_stop_reason_name(reason), cpu->pc, stopped_opcode(cpu),
                     cpu->last_interrupt, cpu->last_interrupt_return,
                     cpu->interrupt_count, cpu->software_reset_count,
                     cpu->reset_interrupt);
            return false;
        }
    }
    return true;
}

struct RunTask {
    Runner* runner;
    Dspic33* cpu;
    const JsonValue* call;
    const JsonValue* stop;
    bool candidate;
    bool succeeded;
    bool execution_failure;
    uint64_t instructions;
    uint64_t cycles;
    char error[256];
#ifdef _WIN32
    bool terminate;
    HANDLE thread;
    HANDLE start_event;
    HANDLE done_event;
#endif
};

static void run_task(RunTask* task) {
    uint64_t instructions = task->cpu->instructions;
    uint64_t cycles = task->cpu->cycles;
    task->succeeded =
        run_image(task->runner, task->cpu, task->candidate, task->call, task->stop,
                  task->error, sizeof(task->error), &task->execution_failure);
    task->instructions = task->cpu->instructions - instructions;
    task->cycles = task->cpu->cycles - cycles;
}

#ifdef _WIN32
static DWORD WINAPI run_task_thread(LPVOID context) {
    RunTask* task = context;
    for (;;) {
        WaitForSingleObject(task->start_event, INFINITE);
        if (task->terminate) {
            return 0u;
        }
        run_task(task);
        SetEvent(task->done_event);
    }
}

static void stop_run_tasks(Runner* runner) {
    size_t index;
    if (runner->run_tasks == NULL) {
        return;
    }
    for (index = 0u; index < 2u; index++) {
        RunTask* task = &runner->run_tasks[index];
        if (task->thread != NULL) {
            task->terminate = true;
            SetEvent(task->start_event);
        }
    }
    for (index = 0u; index < 2u; index++) {
        RunTask* task = &runner->run_tasks[index];
        if (task->thread != NULL) {
            WaitForSingleObject(task->thread, INFINITE);
            CloseHandle(task->thread);
        }
        if (task->start_event != NULL) {
            CloseHandle(task->start_event);
        }
        if (task->done_event != NULL) {
            CloseHandle(task->done_event);
        }
    }
    free(runner->run_tasks);
    runner->run_tasks = NULL;
}

static bool start_run_tasks(Runner* runner) {
    size_t index;
    runner->run_tasks = calloc(2u, sizeof(*runner->run_tasks));
    if (runner->run_tasks == NULL) {
        return false;
    }
    for (index = 0u; index < 2u; index++) {
        RunTask* task = &runner->run_tasks[index];
        task->runner = runner;
        task->cpu = index == 0u ? &runner->reference : &runner->candidate;
        task->candidate = index != 0u;
        task->start_event = CreateEventA(NULL, FALSE, FALSE, NULL);
        task->done_event = CreateEventA(NULL, FALSE, FALSE, NULL);
        if (task->start_event == NULL || task->done_event == NULL) {
            stop_run_tasks(runner);
            return false;
        }
        task->thread = CreateThread(NULL, 0u, run_task_thread, task, 0u, NULL);
        if (task->thread == NULL) {
            stop_run_tasks(runner);
            return false;
        }
    }
    return true;
}
#else
static void stop_run_tasks(Runner* runner) { (void)runner; }

static bool start_run_tasks(Runner* runner) {
    (void)runner;
    return true;
}
#endif

static bool run_pair(Runner* runner, const JsonValue* call, const JsonValue* stop,
                     char* error, size_t error_size, bool* execution_failure) {
#ifdef _WIN32
    RunTask* reference = &runner->run_tasks[0];
    RunTask* candidate = &runner->run_tasks[1];
    HANDLE done_events[2] = {reference->done_event, candidate->done_event};
    reference->call = call;
    reference->stop = stop;
    reference->succeeded = false;
    reference->error[0] = '\0';
    candidate->call = call;
    candidate->stop = stop;
    candidate->succeeded = false;
    candidate->error[0] = '\0';
    SetEvent(reference->start_event);
    SetEvent(candidate->start_event);
    WaitForMultipleObjects(2u, done_events, TRUE, INFINITE);
#else
    RunTask reference_task = {
        .runner = runner, .cpu = &runner->reference, .call = call, .stop = stop};
    RunTask candidate_task = {.runner = runner,
                              .cpu = &runner->candidate,
                              .call = call,
                              .stop = stop,
                              .candidate = true};
    RunTask* reference = &reference_task;
    RunTask* candidate = &candidate_task;
    run_task(reference);
    run_task(candidate);
#endif
    runner->reference_instructions += reference->instructions;
    runner->candidate_instructions += candidate->instructions;
    runner->reference_cycles += reference->cycles;
    runner->candidate_cycles += candidate->cycles;
    *execution_failure = false;
    if (!reference->succeeded) {
        *execution_failure = reference->execution_failure;
        snprintf(error, error_size, "%s", reference->error);
        print_cpu_diagnostics(&runner->reference);
        return false;
    }
    if (!candidate->succeeded) {
        *execution_failure = candidate->execution_failure;
        snprintf(error, error_size, "%s", candidate->error);
        print_cpu_diagnostics(&runner->candidate);
        return false;
    }
    return true;
}

