tylertms/dspic33e-sim/src/firmware_runner.c
static bool add_common_parts(Runner* runner, const JsonValue* scenario,
                             StepParts* parts, char* error, size_t error_size) {
    return add_part(parts, json_get(suite_section(runner, "testbench"), "defaults"),
                    error, error_size) &&
           add_part(parts, json_get(scenario, "defaults"), error, error_size);
}

static bool execute_regular_steps(Runner* runner, const JsonValue* scenario,
                                  const JsonValue* steps, const char* scenario_name,
                                  char* error, size_t error_size) {
    const JsonValue* scenario_call = json_get(scenario, "call");
    size_t index;
    for (index = 0u; index < steps->as.array.count; index++) {
        StepParts parts = {0};
        if (!step_selected(runner, steps->as.array.items[index])) {
            continue;
        }
        if (!add_common_parts(runner, scenario, &parts, error, error_size) ||
            !add_part(&parts, steps->as.array.items[index], error, error_size) ||
            !execute_step(runner, scenario_name, NULL, &parts, scenario_call, NULL, 0,
                          NULL, 0u, error, error_size)) {
            return false;
        }
    }
    return true;
}

static bool execute_range(Runner* runner, const JsonValue* scenario,
                          const JsonValue* range, const char* scenario_name,
                          char* error, size_t error_size) {
    const JsonValue* scenario_call = json_get(scenario, "call");
    const JsonValue* base = json_get(range, "step");
    const char* reg = json_string(json_get(range, "register"));
    size_t count = values_count(runner, range);
    size_t index;
    for (index = 0u; index < count; index++) {
        StepParts parts = {0};
        int64_t value;
        char name[512];
        if (!value_at(runner, range, index, &value)) {
            return false;
        }
        snprintf(name, sizeof(name), "%s at %s=0x%" PRIx64, scenario_name,
                 reg == NULL ? "value" : reg, (uint64_t)value);
        if (!generated_step_selected(runner, name)) {
            continue;
        }
        if (!add_common_parts(runner, scenario, &parts, error, error_size) ||
            !add_part(&parts, base, error, error_size) ||
            !execute_step(runner, scenario_name, name, &parts, scenario_call, range,
                          value, NULL, 0u, error, error_size)) {
            return false;
        }
    }
    return true;
}

static bool select_matrix_case(const Runner* runner, const JsonValue* dimension,
                               size_t index, MatrixSelection* selection) {
    memset(selection, 0, sizeof(*selection));
    selection->specification = dimension;
    if (dimension->type == JSON_ARRAY) {
        if (index >= dimension->as.array.count) {
            return false;
        }
        selection->explicit_case = dimension->as.array.items[index];
        return true;
    }
    selection->generated = true;
    return value_at(runner, dimension, index, &selection->value);
}

static bool execute_matrix_selection(Runner* runner, const JsonValue* scenario,
                                     const JsonValue* matrix,
                                     const MatrixSelection* selections,
                                     size_t selection_count, const char* scenario_name,
                                     size_t ordinal, char* error, size_t error_size) {
    StepParts parts = {0};
    const JsonValue* scenario_call = json_get(scenario, "call");
    char name[512];
    size_t index;
    snprintf(name, sizeof(name), "%s matrix case %zu", scenario_name, ordinal + 1u);
    if (!generated_step_selected(runner, name)) {
        return true;
    }
    if (!add_common_parts(runner, scenario, &parts, error, error_size) ||
        !add_part(&parts, json_get(matrix, "step"), error, error_size)) {
        return false;
    }
    for (index = 0u; index < selection_count; index++) {
        if (!add_part(&parts, selections[index].explicit_case, error, error_size)) {
            return false;
        }
    }
    return execute_step(runner, scenario_name, name, &parts, scenario_call, NULL, 0,
                        selections, selection_count, error, error_size);
}

static bool execute_product_matrix(Runner* runner, const JsonValue* scenario,
                                   const JsonValue* matrix, const JsonValue* dimensions,
                                   const char* scenario_name, char* error,
                                   size_t error_size) {
    size_t counts[MAX_MATRIX_DIMENSIONS];
    size_t indices[MAX_MATRIX_DIMENSIONS] = {0};
    MatrixSelection selections[MAX_MATRIX_DIMENSIONS];
    size_t ordinal = 0u;
    size_t dimension;
    for (dimension = 0u; dimension < dimensions->as.array.count; dimension++) {
        const JsonValue* value = dimensions->as.array.items[dimension];
        counts[dimension] = value->type == JSON_ARRAY ? value->as.array.count
                                                      : values_count(runner, value);
    }
    for (;;) {
        for (dimension = 0u; dimension < dimensions->as.array.count; dimension++) {
            if (!select_matrix_case(runner, dimensions->as.array.items[dimension],
                                    indices[dimension], &selections[dimension])) {
                return false;
            }
        }
        if (!execute_matrix_selection(runner, scenario, matrix, selections,
                                      dimensions->as.array.count, scenario_name,
                                      ordinal++, error, error_size)) {
            return false;
        }
        dimension = dimensions->as.array.count;
        while (dimension != 0u) {
            dimension--;
            if (++indices[dimension] < counts[dimension]) {
                break;
            }
            indices[dimension] = 0u;
        }
        if (dimension == 0u && indices[0] == 0u) {
            return true;
        }
    }
}

static bool execute_pairwise_matrix(Runner* runner, const JsonValue* scenario,
                                    const JsonValue* matrix,
                                    const JsonValue* dimensions,
                                    const char* scenario_name, char* error,
                                    size_t error_size) {
    MatrixSelection selections[MAX_MATRIX_DIMENSIONS];
    size_t counts[MAX_MATRIX_DIMENSIONS];
    size_t ordinal = 0u;
    size_t left;
    size_t right;
    size_t index;
    size_t other;
    for (index = 0u; index < dimensions->as.array.count; index++) {
        const JsonValue* dimension = dimensions->as.array.items[index];
        counts[index] = dimension->type == JSON_ARRAY ? dimension->as.array.count
                                                      : values_count(runner, dimension);
        if (!select_matrix_case(runner, dimension, 0u, &selections[index])) {
            return false;
        }
    }
    if (!execute_matrix_selection(runner, scenario, matrix, selections,
                                  dimensions->as.array.count, scenario_name, ordinal++,
                                  error, error_size)) {
        return false;
    }
    for (index = 0u; index < dimensions->as.array.count; index++) {
        for (other = 1u; other < counts[index]; other++) {
            MatrixSelection changed;
            if (!select_matrix_case(runner, dimensions->as.array.items[index], other,
                                    &changed)) {
                return false;
            }
            selections[index] = changed;
            if (!execute_matrix_selection(runner, scenario, matrix, selections,
                                          dimensions->as.array.count, scenario_name,
                                          ordinal++, error, error_size) ||
                !select_matrix_case(runner, dimensions->as.array.items[index], 0u,
                                    &selections[index])) {
                return false;
            }
        }
    }
    for (left = 0u; left < dimensions->as.array.count; left++) {
        for (right = left + 1u; right < dimensions->as.array.count; right++) {
            size_t left_case;
            size_t right_case;
            for (left_case = 1u; left_case < counts[left]; left_case++) {
                for (right_case = 1u; right_case < counts[right]; right_case++) {
                    if (!select_matrix_case(runner, dimensions->as.array.items[left],
                                            left_case, &selections[left]) ||
                        !select_matrix_case(runner, dimensions->as.array.items[right],
                                            right_case, &selections[right]) ||
                        !execute_matrix_selection(runner, scenario, matrix, selections,
                                                  dimensions->as.array.count,
                                                  scenario_name, ordinal++, error,
                                                  error_size)) {
                        return false;
                    }
                }
            }
            if (!select_matrix_case(runner, dimensions->as.array.items[left], 0u,
                                    &selections[left]) ||
                !select_matrix_case(runner, dimensions->as.array.items[right], 0u,
                                    &selections[right])) {
                return false;
            }
        }
    }
    return true;
}

static bool execute_matrix(Runner* runner, const JsonValue* scenario,
                           const JsonValue* matrix, const char* scenario_name,
                           char* error, size_t error_size) {
    const JsonValue* dimensions = json_get(matrix, "dimensions");
    const char* strategy = json_string(json_get(matrix, "strategy"));
    if (dimensions == NULL || dimensions->type != JSON_ARRAY ||
        dimensions->as.array.count == 0u ||
        dimensions->as.array.count > MAX_MATRIX_DIMENSIONS) {
        return false;
    }
    if (strategy != NULL && strcmp(strategy, "pairwise") == 0) {
        return execute_pairwise_matrix(runner, scenario, matrix, dimensions,
                                       scenario_name, error, error_size);
    }
    return execute_product_matrix(runner, scenario, matrix, dimensions, scenario_name,
                                  error, error_size);
}

